10/data/attachments/8fd03ed89dd1cac5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_6d553ce9-cb50-40df-a0db-649e302c6661</nif:username>
            <nif:friendToBeAdded>Joseph_bill_Friend_35577_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>